# LandingTwoManyLoops Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..LandingTwoManyLoops Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch landing can only have one closed loop
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LandingTwoManyLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LandingTwoManyLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LandingTwoManyLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace